Core/src/Documents/СписаниеТопливаЗапасов/СписаниеТопливаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТопливаЗапасов</name>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаОСиТС</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоРасходуТС</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеТопливаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСДатойДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегОкончание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПробегРазница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйБак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/СписаниеТопливаЗапасов/Forms/ФормаЗагрузкеИзТабличногоДокумента/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогВыбораФайла.ПолноеИмяФайла = "";
    Фильтр = "Табличный документ (*.xls, *.xlsx, *.mxl)|*.xls;*.xlsx;*.mxl|";
    ДиалогВыбораФайла.Фильтр = Фильтр;
    ДиалогВыбораФайла.Заголовок = "Выберите файлы";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
        ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроичитатьФайл(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда 
		Сообщить(НСтр("ru = 'Укажите путь к файлу!'; ka = 'აირჩიეთ ფაილი და დააჭირეთ ღილაკს ფაილის წაკითხვა'"));
		Возврат;
	КонецЕсли;
	
	ПроичитатьФайлНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроичитатьФайлНаСервере()
	
	ТабличныйДокумент.Прочитать(ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	ОткрытьФорму("Документ.СписаниеТопливаЗапасов.Форма.ФормаНастройкиЧтенияТабличногоДокумента", Новый Структура("СписокКолонок, ЭтоТопливо", СписокЗначенийНастройкиКолонок, Истина), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресРасходовВХранилище") Тогда 
		АдресРасходовВХранилище = Параметры.АдресРасходовВХранилище;
	КонецЕсли;
	
	СтруктураТиповДанныхКолонок = Новый Структура;
	СтруктураТиповДанныхКолонок.Вставить("Дата", "Дата");
	СтруктураТиповДанныхКолонок.Вставить("Номенклатура", Новый Структура("Класс, Имя", "Справочник", "Номенклатура"));
	СтруктураТиповДанныхКолонок.Вставить("Характеристика", Новый Структура("Класс, Имя", "Справочник", "ХарактеристикиНоменклатуры"));
	СтруктураТиповДанныхКолонок.Вставить("Количество", "Число");
	СтруктураТиповДанныхКолонок.Вставить("ПробегНачало", "Число");
	СтруктураТиповДанныхКолонок.Вставить("ПробегОкончание", "Число");
	СтруктураТиповДанныхКолонок.Вставить("ПробегРазница", "Число");
	СтруктураТиповДанныхКолонок.Вставить("ПолныйБак", "Булево");
	СтруктураТиповДанныхКолонок.Вставить("СтруктурнаяЕдиница", Новый Структура("Класс, Имя", "Справочник", "СтруктурныеЕдиницы"));
	СтруктураТиповДанныхКолонок.Вставить("Подразделение", Новый Структура("Класс, Имя", "Справочник", "СтруктурныеЕдиницы"));
	СтруктураТиповДанныхКолонок.Вставить("НаправлениеДеятельности", Новый Структура("Класс, Имя", "Справочник", "НаправленияДеятельности"));
	СтруктураТиповДанныхКолонок.Вставить("СчетУчетаЗатрат", Новый Структура("Класс, Имя", "ПланСчетов", "Хозрасчетный"));
	
	МассивСоставногоТипа = Новый Массив;
	МассивСоставногоТипа.Добавить(Новый Структура("Класс, Имя", "Справочник", "ВнеоборотныеАктивы"));
	МассивСоставногоТипа.Добавить(Новый Структура("Класс, Имя", "Справочник", "ТранспортныеСредства"));
	СтруктураТиповДанныхКолонок.Вставить("ВнеоборотныйАктив", МассивСоставногоТипа);
	
	Элементы.РезультатРаспознания.Видимость = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НастройкаЗагрузкиИзТабличногоДокумента_СпианиеТопливаЗапасов" Тогда 
		
		СписокЗначенийНастройкиКолонок.Очистить();
		Для Каждого ЭлемСтруктуры Из Параметр Цикл 
			СписокЗначенийНастройкиКолонок.Добавить(ЭлемСтруктуры.Ключ, ЭлемСтруктуры.Значение);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(КлассОбъекта, ИмяОбъекта)
	
	Возврат 
		"ВЫБРАТЬ
		|	ОбъектЗапроса.Ссылка КАК Ссылка,
		|	ОбъектЗапроса.Код КАК Код,
		|	ОбъектЗапроса.Наименование КАК Наименование
		|ИЗ
		|	"+КлассОбъекта+"."+ИмяОбъекта+" КАК ОбъектЗапроса
		|ГДЕ
		|	НЕ ОбъектЗапроса.ПометкаУдаления";
		//|	И НЕ ОбъектЗапроса.ЭтоГруппа";
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПоиску(ИмяКолонки)

	ТаблицаВозврата = Новый ТаблицаЗначений;
	
	Если СтруктураТиповДанныхКолонок.Свойство(ИмяКолонки) Тогда
		
		Если ТипЗнч(СтруктураТиповДанныхКолонок[ИмяКолонки]) = Тип("Структура") Тогда 
			
			СтруктураДляЗапроса = СтруктураТиповДанныхКолонок[ИмяКолонки];
			
			Запрос = Новый Запрос;
			Запрос.Текст = ПолучитьТекстЗапроса(СтруктураДляЗапроса.Класс, СтруктураДляЗапроса.Имя);
			ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли ТипЗнч(СтруктураТиповДанныхКолонок[ИмяКолонки]) = Тип("Массив") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "";
			КоличествоИтераций = 1;
			Для Каждого ЭлемМасс ИЗ СтруктураТиповДанныхКолонок[ИмяКолонки] Цикл 
				
				СтруктураДляЗапроса = ЭлемМасс;
				
				Запрос.Текст = Запрос.Текст + ПолучитьТекстЗапроса(СтруктураДляЗапроса.Класс, СтруктураДляЗапроса.Имя);
				
				Если СтруктураТиповДанныхКолонок[ИмяКолонки].Количество() <> КоличествоИтераций Тогда 
					
					Запрос.Текст = Запрос.Текст + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|";
					
				КонецЕсли;
				
				КоличествоИтераций = КоличествоИтераций + 1;
				
			КонецЦикла;
			
			ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
	КонецЕсли;	

	Возврат ТаблицаВозврата;
	
КонецФункции // ПолучитьТаблицуПоиску(ЭлемСписка.Представление)()

&НаСервере
Функция ОпределитьСсылку(ТаблицаПоиска, ТекстЯчейки, НомерСтроки, НаименованиеКолонки)

	ПоискСтрокиНаименование = ТаблицаПоиска.НайтиСтроки(Новый Структура("Наименование", ТекстЯчейки));
	
	Если ПоискСтрокиНаименование.Количество() = 1 Тогда 
		Возврат ПоискСтрокиНаименование[0].Ссылка;
	ИначеЕсли ПоискСтрокиНаименование.Количество() > 1 Тогда
		Сообщить("Строка №: "+НомерСтроки+", Найдено более одного элемента с наименованием """+ТекстЯчейки+"""");
		Возврат НЕОПРЕДЕЛЕНО;
	КонецЕсли;	

	ПоискСтрокиКод = ТаблицаПоиска.НайтиСтроки(Новый Структура("Код", ТекстЯчейки));
	
	Если ПоискСтрокиКод.Количество() = 1 Тогда 
		Возврат ПоискСтрокиКод[0].Ссылка;
	ИначеЕсли ПоискСтрокиКод.Количество() > 1 Тогда
		Сообщить("Строка №: "+НомерСтроки+", Найдено более одного элемента с кодом """+ТекстЯчейки+"""");
		Возврат НЕОПРЕДЕЛЕНО;
	КонецЕсли;
	
	Сообщить("Строка №: "+НомерСтроки+", Поиск по коду и по наименованию не дал результат. Значение поиска: """+ТекстЯчейки+"""");
	Возврат НЕОПРЕДЕЛЕНО;
	
КонецФункции // ОпределитьСсылку(ТаблицаПоиска, ТекстЯчейки)()

&НаСервере
Процедура РаспознатьДанныеНаСервере()
	
	ТаблицаРезультат.Очистить();
	Элементы.Декорация1.Видимость = Истина;
	
	Элементы.ТабличныйДокумент.Видимость = ЛОЖЬ;
	
	тзОбрабоки = ТаблицаРезультат.Выгрузить();
	МассивНомеровКолонок = Новый Массив;
	
	СтруктураТаблицПоиска = Новый Структура;
	Для Каждого ЭлемСписка Из СписокЗначенийНастройкиКолонок Цикл 
		
		Элементы["ТаблицаРезультат"+ЭлемСписка.Представление].Видимость = Истина;
		
		НомерКолонки = СокрЛП(Стрзаменить(Строка(ЭлемСписка.Значение), "Колонка", ""));
		МассивНомеровКолонок.Добавить(НомерКолонки);
		
		Если НЕ СтруктураТиповДанныхКолонок[ЭлемСписка.Представление] = "Число" 
			И НЕ СтруктураТиповДанныхКолонок[ЭлемСписка.Представление] = "Строка" 
			И НЕ СтруктураТиповДанныхКолонок[ЭлемСписка.Представление] = "Булево" 
			И НЕ СтруктураТиповДанныхКолонок[ЭлемСписка.Представление] = "Дата" Тогда
			
			СтруктураТаблицПоиска.Вставить(ЭлемСписка.Представление, ПолучитьТаблицуПоиску(ЭлемСписка.Представление));
			
		КонецЕсли;
		
	КонецЦикла;
	
	НомерСтроки = ?(НачальнаяСтрокаЧтения = 0, 1, НачальнаяСтрокаЧтения);
	КолвоПустыхСтрокПодряд = 0;
	Пока Истина Цикл
		
		ВсяСтрокаПустая = Истина;
		СтруктураЗаполнения = Новый Структура;
		Для Каждого ЭлемМасс Из МассивНомеровКолонок Цикл 
			
			ТекстЯчейки = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=0")+"C"+Формат(ЭлемМасс,"ЧГ=0")).Текст);
			
			НаименованиеКолонки = СписокЗначенийНастройкиКолонок.НайтиПоЗначению("Колонка"+ЭлемМасс).Представление;
			
			Если НЕ ТекстЯчейки = "" Тогда 
				ВсяСтрокаПустая = ЛОЖЬ;
			Иначе
				Если НЕ СтруктураЗаполнения.Свойство(НаименованиеКолонки) Тогда 
					СтруктураЗаполнения.Вставить(НаименованиеКолонки, Неопределено);
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			
			Если СтруктураТаблицПоиска.Свойство(НаименованиеКолонки) Тогда 
				// Значит есть ТЗ
				ТаблицаПоиска = СтруктураТаблицПоиска[НаименованиеКолонки];
				
				Если НЕ СтруктураЗаполнения.Свойство(НаименованиеКолонки) Тогда 
					СтруктураЗаполнения.Вставить(НаименованиеКолонки, ОпределитьСсылку(ТаблицаПоиска, ТекстЯчейки, НомерСтроки, НаименованиеКолонки));
				КонецЕсли;
				
			Иначе
				// Либо простой тип данных или нужно пропускать колонку
				Если СтруктураТиповДанныхКолонок[НаименованиеКолонки] = "Число" Тогда 
					
					Если НЕ СтруктураЗаполнения.Свойство(НаименованиеКолонки) Тогда 
						СтруктураЗаполнения.Вставить(НаименованиеКолонки, 0);
					КонецЕсли;
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтруктураЗаполнения[НаименованиеКолонки], ТекстЯчейки, 0);
					
				ИначеЕсли СтруктураТиповДанныхКолонок[НаименованиеКолонки] = "Строка" Тогда
					
					Если НЕ СтруктураЗаполнения.Свойство(НаименованиеКолонки) Тогда 
						СтруктураЗаполнения.Вставить(НаименованиеКолонки, ТекстЯчейки);
					КонецЕсли;
					
				ИначеЕсли СтруктураТиповДанныхКолонок[НаименованиеКолонки] = "Булево" Тогда
					
					Если НЕ СтруктураЗаполнения.Свойство(НаименованиеКолонки) Тогда 
						СтруктураЗаполнения.Вставить(НаименованиеКолонки, ЛОЖЬ);
					КонецЕсли;
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтруктураЗаполнения[НаименованиеКолонки], ТекстЯчейки);
					
				ИначеЕсли СтруктураТиповДанныхКолонок[НаименованиеКолонки] = "Дата" Тогда
					
					Если НЕ СтруктураЗаполнения.Свойство(НаименованиеКолонки) Тогда 
						СтруктураЗаполнения.Вставить(НаименованиеКолонки, Дата(1,1,1));
					КонецЕсли;
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтруктураЗаполнения[НаименованиеКолонки], ТекстЯчейки);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВсяСтрокаПустая Тогда 
			КолвоПустыхСтрокПодряд = КолвоПустыхСтрокПодряд + 1;
		Иначе
			КолвоПустыхСтрокПодряд = 0;
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗаполнения);
		КонецЕсли;
		
		Если КолвоПустыхСтрокПодряд > 10 Тогда 
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Элементы.Декорация1.Видимость = ЛОЖЬ;
	
	Элементы.ТабличныйДокумент.Видимость = ИСтина;
	
	Элементы.РезультатРаспознания.Видимость = Истина;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.РезультатРаспознания;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьДанные(Команда)
	РаспознатьДанныеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	РасходыВХранилище = ТаблицаРезультат.Выгрузить();
	ПоместитьВоВременноеХранилище(РасходыВХранилище, АдресРасходовВХранилище);
	
КонецПроцедуры
